---
kind: property
id: P:Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Stage
source: html/3d8ca3f6-2e0d-c45a-c58d-40170ea037d9.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Stage Property

The current stage of the progress bar

## Syntax (C#)
```csharp
public ProgressStage Stage { get; }
```